[
    { "Q": "What is cryptography?", "A": "Cryptography is a method of protecting information and communications through the use of codes so that only those for whom the information is intended can read and process it." },
    { "Q": "What is encryption?", "A": "In cryptography, encryption is the process of encoding a message or information in such a way that only authorized parties can access it and those who are not authorized cannot. Encryption does not itself prevent interference, but denies the intelligible content to a would-be interceptor." },
    { "Q": "What is decryption?", "A": "Decryption is the process of taking encoded or encrypted text or other data and converting it back into text that you or the computer can read and understand. This term could be used to describe a method of unencrypting the data manually or unencrypting the data using the proper codes or keys." },
    { "Q": "What is symmetric cryptography?", "A": "Symmetric-key algorithms are algorithms for cryptography that use the same cryptographic keys for both encryption of plaintext and decryption of ciphertext. The keys may be identical or there may be a simple transformation to go between the two keys. " },
    { "Q": "What is asymmetric cryptography?", "A": "Public-key cryptography, or asymmetric cryptography, is a cryptographic system that uses pairs of keys: public keys which may be disseminated widely, and private keys which are known only to the owner." },
    { "Q": "What is public-key cryptography?", "A": "Public-key cryptography, or asymmetric cryptography, is a cryptographic system that uses pairs of keys: public keys which may be disseminated widely, and private keys which are known only to the owner." },
    { "Q": "What is public key and private key?", "A": "Private Key and public key are a part of encryption that encodes the information. Both keys work in two encryption systems called symmetric and asymmetric. Symmetric encryption (private-key encryption or secret-key encryption) utilize the same key for encryption and decryption. Asymmetric encryption utilizes a pair of keys like public and private key for better security where a message sender encrypts the message with the public key and the receiver decrypts it with his/her private key." },
    { "Q": "What is hash function?", "A": "A hash function is any function that can be used to map data of arbitrary size onto data of a fixed size. The values returned by a hash function are called hash values, hash codes, digests, or simply hashes. Hash functions accelerate table or database lookup by detecting duplicated records in a large file." }
]